ZKRT/MainboardBoot/sample/STM32/OnBoardSDK_STM32/Zkrt/flash_if.h
/**
  ******************************************************************************
  * @file    STM32F4xx_IAP/inc/flash_if.h
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    10-October-2011
  * @brief   This file provides all the headers of the flash_if functions.
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __FLASH_IF_H
#define __FLASH_IF_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx.h"

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Base address of the Flash sectors */
#define ADDR_FLASH_SECTOR_0     ((uint32_t)0x08000000) /* Base @ of Sector 0, 16 Kbyte */
#define ADDR_FLASH_SECTOR_1     ((uint32_t)0x08004000) /* Base @ of Sector 1, 16 Kbyte */
#define ADDR_FLASH_SECTOR_2     ((uint32_t)0x08008000) /* Base @ of Sector 2, 16 Kbyte */
#define ADDR_FLASH_SECTOR_3     ((uint32_t)0x0800C000) /* Base @ of Sector 3, 16 Kbyte */
#define ADDR_FLASH_SECTOR_4     ((uint32_t)0x08010000) /* Base @ of Sector 4, 64 Kbyte */
#define ADDR_FLASH_SECTOR_5     ((uint32_t)0x08020000) /* Base @ of Sector 5, 128 Kbyte */
#define ADDR_FLASH_SECTOR_6     ((uint32_t)0x08040000) /* Base @ of Sector 6, 128 Kbyte */
#define ADDR_FLASH_SECTOR_7     ((uint32_t)0x08060000) /* Base @ of Sector 7, 128 Kbyte */
#define ADDR_FLASH_SECTOR_8     ((uint32_t)0x08080000) /* Base @ of Sector 8, 128 Kbyte */
#define ADDR_FLASH_SECTOR_9     ((uint32_t)0x080A0000) /* Base @ of Sector 9, 128 Kbyte */
#define ADDR_FLASH_SECTOR_10    ((uint32_t)0x080C0000) /* Base @ of Sector 10, 128 Kbyte */
#define ADDR_FLASH_SECTOR_11    ((uint32_t)0x080E0000) /* Base @ of Sector 11, 128 Kbyte */

/* stm32f4x series end address*/
#define STM32F407ZET6_END_ADDRESS     (ADDR_FLASH_SECTOR_8 -1)  //512K

/*Bootloader flash address*/
#define BOOT_ADDRESS                  ADDR_FLASH_SECTOR_0
#define BOOT_FLASH_END_ADDRESS        (uint32_t)0x0801FFFF  
#define BOOT_FLASH_SIZE               (BOOT_FLASH_END_ADDRESS - BOOT_ADDRESS + 1) //128K

/* user config info address*/
#define USER_CONFIG_ADDRESS           ADDR_FLASH_SECTOR_7
#define USER_CONFIG_END_ADDRESS       STM32F407ZET6_END_ADDRESS
#define USER_CONFIG_SIZE              (USER_CONFIG_END_ADDRESS - USER_CONFIG_ADDRESS + 1)

/* Define the address from where user application will be loaded.*/
#define APPLICATION_ADDRESS           ADDR_FLASH_SECTOR_5  
#define USER_FLASH_END_ADDRESS        (ADDR_FLASH_SECTOR_7-1)   
#define USER_FLASH_SIZE               (USER_FLASH_END_ADDRESS - APPLICATION_ADDRESS + 1)  //256K

//////////user flash
#pragma pack(push, 1)
typedef struct _flash_type	
{
	uint32_t _start_cod;
	u32 api_enabled;
	u32 program_mode;	
	short _tempture_low;
	short _tempture_high;
	u8 avoid_ob_enabled;    
	u16 avoid_ob_distse;   
	u8 uce_autoenabled;   
	u16 avoid_ob_velocity;
	uint32_t _end_cod;
}flash_type;
#pragma pack(pop)
extern flash_type user_flash_buffer;
#define FLASH_USE_NUM    (sizeof(user_flash_buffer)/4 + ((sizeof(user_flash_buffer)%4 == 0)?0:1))
///////////////

/* Exported macro ------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */
void FLASH_If_Init(void);
uint32_t FLASH_If_Erase(uint32_t StartSector);
uint32_t FLASH_If_Write(__IO uint32_t* FlashAddress, uint32_t* Data, uint32_t DataLength);
uint16_t FLASH_If_GetWriteProtectionStatus(void);
uint32_t FLASH_If_DisableWriteProtection(void);
void userflash_read(uint32_t Address);
uint32_t userflash_write(uint32_t Address);
#ifdef __cplusplus
}
#endif
#endif  /* __FLASH_IF_H */

/*******************(C)COPYRIGHT 2011 STMicroelectronics *****END OF FILE******/
